# Team standings

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

Write a query to return the scores of each team in the teams table after all matches displayed in the matches table. Points are awarded as follows: zero points for a loss, one point for a tie, and three points for a win. The result should include team name and points, and be ordered by decreasing points. In case of a tie, order by alphabetized team name.

In [1]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.
 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.

In [2]:
%%sql

SELECT * FROM teams

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, 'New York'),
 (2, 'Atlanta'),
 (3, 'Chicago'),
 (4, 'Toronto'),
 (5, 'Los Angeles'),
 (6, 'Seattle')]

In [3]:
%%sql

SELECT * FROM matches

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, 1, 2, 3, 0),
 (2, 2, 3, 2, 4),
 (3, 3, 4, 4, 3),
 (4, 4, 5, 1, 1),
 (5, 5, 6, 2, 1),
 (6, 6, 1, 1, 2)]

# Part B

Using the subquery from Part A, determine the number of points each team earned as the host team.

```sql
WITH points AS (
    SELECT 
        *, 
        CASE 
            WHEN host_goals > guest_goals THEN 3 
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS host_points,

        CASE 
            WHEN host_goals < guest_goals THEN 3
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS guest_points
    FROM matches 
)
```

## The expected output

|city|host_points|
|--- |--- |
|New York|3|
|Atlanta|0|
|Chicago|3|
|Toronto|1|
|Los Angeles|3|
|Seattle|0|

# Type your SQL below

In [5]:
# %%sql
#
# Type your query here